/* Title for generic close button. */
"Generic.Close" = "Close";

/* Description for when provider list is empty. */
"ProviderList.EmptyList" = "No providers found";

/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Create.Subtitle" = "You have successfully connected to %@.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Create.Title" = "Connection successful";

/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Update.Subtitle" = "Your connection to %@ has successfully updated.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Update.Title" = "Update successful";

/* Description shown in the concent information screen. */
"ConsentInformation.Description" = "By following through this service, we'll collect financial data from you. These are the data points we will collect from you";

/* Title shown in the concent information screen. */
"ConsentInformation.Title" = "We'll collect the following data from you";

/* Description text for add credentials screen. */
"Credentials.Description" = "Log in to %@ to continue";


/* Text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"Credentials.ConsentText" = "%@ will obtain some of your financial information. Read More";
/* Title for action to continue adding credentials. */
"Credentials.Discard.ContinueAction" = "Continue Editing";

/* Title for action to discard adding credentials. */
"Credentials.Discard.PrimaryAction" = "Discard Changes";

/* Title for action sheet presented when user tries to dismiss modal while adding credentials. */
"Credentials.Discard.Title" = "Are you sure you want to discard this new credential?";

/* Title for error shown when authentication failed while adding credentials. */
"Credentials.Error.AuthenticationFailed" = "Authentication failed";

/* Message for error shown when credentials already exists. */
"Credentials.Error.CredentialsAlreadyExists" = "You already have a connection to this bank or service.";

/* Default title for error shown when download authentication app is required while adding credentials. */
"Credentials.Error.DownloadRequired" = "Authentication app download required";

/* Title for error shown when a permanent failure occured while adding credentials. */
"Credentials.Error.PermanentFailure" = "Permanent error";

/* Title for error shown when a temporary failure occured while adding credentials. */
"Credentials.Error.TemporaryFailure" = "Temporary error";

/* Instruction texts for credentials that need to redirect */
"Credentials.Instructions" = "1. You will be securely transferred to %@.\r\n2. You will be required to authenticate.\r\n3. Once authenticated, you will be redirected back.";

/* Text for BankID button shown in the add credentials/authenticate screen. */
"Credentials.OpenBankID" = "Open BankID";

/* Privacy policy clickable text used in Credentials.TermsAndConsentText. */
"Credentials.PrivacyPolicy" = "Privacy Policy";


/* Read more text (clickable) to lead to consent information. */
"Credentials.ReadMore" = "Read More";
/* Terms and conditions clickable text used in Credentials.TermsAndConsentText. */
"Credentials.TermsAndConditions" = "Terms and Conditions";

/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions, Privacy Policy. And the text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"Credentials.TermsAndConsentText" = "By using the service, you agree to Tink’s %1$@ and %2$@. %3$@ will obtain parts of your financial information. %4$@";


/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions and Privacy Policy. */
"Credentials.TermsText" = "By using the service, you agree to Tink’s Terms and Conditions and Privacy Policy";
/* Title for add credentials/authenticate screen. */
"Credentials.Title" = "Authentication";


/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Subtitle" = "Your account has successfully connected to %@.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Title" = "Connection successful";
/* Text for the warning shown when the developer is unverified. */
"Credentials.UnverifiedClient" = "Unverified - This solution is only made for development purposes. Do not enter your bank credentials unless you trust the developer.";

/* View details text (clickable) to lead to consent information that used in Credentials.TermsAndConsentText. */
"Credentials.ViewDetails" = "View details";

/* Text shown for progress indicator dialog when in loading state. */
"CredentialsStatus.Authorizing" = "Authorizing…";

/* Text shown for dialog when supplemental information is cancelled and waiting for credential status update. */
"CredentialsStatus.Cancelling" = "Cancelling…";

/* Text shown for dialog when supplemental information is submitted and waiting for credential status update. */
"CredentialsStatus.Sending" = "Sending…";

/* Text shown for progress indicator dialog when status is CredentialStatus.Updating. */
"CredentialsStatus.Updating" = "Connecting to %@, please wait…";

/* Fallback text shown when fail to get bank name while updating credentials. */
"CredentialsStatus.UpdatingFallback" = "Connecting, please wait…";

/* Text shown when adding credentials and waiting for authentication on another device. */
"CredentialsStatus.WaitingForAuthenticationOnAnotherDevice" = "Waiting for authentication on another device";

/* Text for field validation error shown when text entered exceeds character limit. */
"Field.Validation.MaxLengthLimit" = "This field cannot be longer than %d characters";

/* Text for field validation error shown when text entered is shorter than required. */
"Field.Validation.MinLengthLimit" = "This field must be at least %d characters.";

/* Text for field validation error shown when no text is entered for a required field. */
"Field.Validation.RequiredFieldEmptyValue" = "This field cannot be empty";

/* Text used to form a list. */
"Generic.And" = "and";

/* Text shown for Cancel button. */
"Generic.Cancel" = "Cancel";

/* Title for cancelled request. */
"Generic.Cancelled" = "Cancelled";

/* Title for generic button to continue an action. */
"Generic.Continue" = "Continue";

/* Title for action to dismiss error alert. */
"Generic.Dismiss" = "Dismiss";

/* Title for action to confirm an event. */
"Generic.Done" = "Done";

/* Title generic alert. */
"Generic.Error" = "Something went wrong. Please try again later.";

/* Title for generic text to login. */
"Generic.Login" = "Log in";

/* Title for action to confirm alert. */
"Generic.OK" = "OK";

/* Title for action to retry a failed request. */
"Generic.Retry" = "Try again";

/* Title for error alert if error doesn't contain a description. */
"Generic.ServiceAlert.FallbackTitle" = "The service is unavailable at the moment.";

/* Description of the provider capability Checking Accounts. */
"ProviderCapability.CheckingAccounts" = "Checking Accounts";

/* Description of the provider capability Credit Cards. */
"ProviderCapability.CreditCards" = "Credit Cards";

/* Description of the provider capability E-Invoices. */
"ProviderCapability.EInvoices" = "E-Invoices";

/* Description of the provider capability Identity Data. */
"ProviderCapability.IdentityData" = "Identity Data";

/* Description of the provider capability Investments. */
"ProviderCapability.Investments" = "Investments";

/* Description of the provider capability Loans. */
"ProviderCapability.Loans" = "Loans";

/* Description of the provider capability Mortgage Aggregation. */
"ProviderCapability.MortgageAggregation" = "Mortgage Aggregation";

/* Description of the provider capability Mortgage Loan. */
"ProviderCapability.MortgageLoan" = "Mortgage Loan";

/* Description of the provider capability Payments. */
"ProviderCapability.Payments" = "Payments";

/* Description of the provider capability Savings Accounts. */
"ProviderCapability.SavingsAccounts" = "Savings Accounts";

/* Description of the provider capability Transfers. */
"ProviderCapability.Transfers" = "Transfers";

/* Description for error when providers could not be loaded. */
"ProviderList.Error.Description" = "We are informed of this error and are working hard to resolve it. Bear with us, and try again a bit later.";

/* Description for error when providers could not be loaded and it is likely it's a temporary error. */
"ProviderList.Error.Temporary" = "This could be a temporary error, please try again and see if the problem persists.";

/* Title for when providers could not be loaded. */
"ProviderList.Error.Title" = "We’re sorry, but we couldn't load any banks at the moment";

/* Placeholder in search field shown in provider list. */
"ProviderList.SearchHint" = "Search for a bank or card";

/* Title for list of all providers. */
"ProviderList.Title" = "Choose bank";

/* Information text shown in the choose access type screen. */
"SelectAccessType.Information" = "Due to EU regulations different account types need to be connected separately.";

/* Title for the other account type (not an open banking account type) on the choose access type screen. */
"SelectAccessType.OtherType" = "Other";

/* Title of the choose access type screen. */
"SelectAccessType.Title" = "Connection type";

/* Title for the business authentication user type */
"SelectAuthenticationUserType.Business" = "Business";

/* Title for the corporate authentication user type */
"SelectAuthenticationUserType.Corporate" = "Corporate";

/* Title for the personal authentication user type */
"SelectAuthenticationUserType.Personal" = "Personal";

/* Title when picking authentication user type. */
"SelectAuthenticationUserType.Title" = "Login type";

/* Title for choose credential type screen. */
"SelectCredentialsType.Title" = "Sign in method";

/* Description shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeDescription" = "Open the BankID app and scan this QR code to authenticate.";

/* Error shown when QR code cannot be fetched/generated/displayed. */
"SupplementalInformation.QRCodeError" = "There is an error to load the QR code. Please try again later.";

/* Title shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeTitle" = "Open the BankID app";

/* Title for button to submit supplemental information. */
"SupplementalInformation.Submit" = "Submit";

/* Title of the supplemental information dialog. */
"SupplementalInformation.Title" = "Supplemental information";

/* Title for action to download app for third-party app authentication. */
"ThirdPartyAppAuthentication.DownloadAlert.Download" = "Download";

